const phone = process.env.NEXT_PUBLIC_PHONE

const tags = {
  // Главная
  '/': {
    title: 'ᐉ Агентство недвижимости: риэлторское агентство | Altera',
    description: `🏡 Агентство недвижимости «Альтера» с выгодными условиями.\n⭐️ Услуги риэлтерского агентства: продажа, покупка и аренда недвижимости в Москве, Сочи, Казани, Санкт-Петербурге и других крупных городах.\n☎️ Телефон: ${phone}.`,
    keywords: [
      'Агентство недвижимости',
      'Altera',
      'Альтера',
    ]
  },
  // Покупка первичной недвижимости
  '/buy-primary': {
    title: 'ᐉ Купить квартиру в новостройке выгодно - подбор квартиры | Altera',
    description: `🏡 Купите квартиру в новостройке с риэлтором агентства недвижимости «Альтера».\n⭐️ Выгодные цены и быстрый поиск квартиры в Москве, Сочи, Казани, Санкт-Петербурге и других крупных городах.\n☎️ Телефон: ${phone}.`,
    keywords: [
      'Агентство недвижимости',
      'Altera',
      'Альтера',
    ]
  },
  // Покупка вторичной недвижимости
  '/buy-secondary': {
    title: 'ᐉ Купить квартиру на вторичке в Казани: недорого и быстро | Altera',
    description: `🏡 Купите квартиру на вторичном рынке с риэлтором агентства недвижимости «Альтера».\n⭐️ Выгодные цены и быстрый поиск квартиры в Москве, Сочи, Казани, Санкт-Петербурге и других крупных городах.\n☎️ Телефон: ${phone}.`,
    keywords: [
      'Агентство недвижимости',
      'Altera',
      'Альтера',
    ]
  },
  // Покупка загородной недвижимости
  '/buy-suburban': {
    title: 'ᐉ Купить загородную недвижимость выгодно - подбор коттеджей и домов | Altera',
    description: `🏡 Купите дом и коттедж за городом с помощью агента недвижимости «Альтера».\n⭐️ Выгодные цены с льготной ипотекой и быстрый подбор в Москве, Сочи, Казани, Санкт-Петербурге и других крупных городах.\n☎️ Телефон: ${phone}.`,
    keywords: [
      'Агентство недвижимости',
      'Altera',
      'Альтера',
    ]
  },
  // Коммерческая недвижимость
  '/commercial-residence': {
    title: 'ᐉ Купить коммерческую недвижимость выгодно - помощь с подбором | Altera',
    description: `🏡 Купите коммерческую недвижимость с помощью агента компании «Альтера».\n⭐️ Выгодные цены и быстрый поиск недвижимости в Москве, Сочи, Казани, Санкт-Петербурге и других крупных городах.\n☎️ Телефон: ${phone}.`,
    keywords: [
      'Агентство недвижимости',
      'Altera',
      'Альтера',
    ]
  },
  // Продажа недвижимости
  '/sell-residence': {
    title: 'ᐉ Продать недвижимость выгодно и быстро | Altera',
    description: `🏡 Продайте квартиру и другую недвижимость с риэлтором компании «Альтера» в Москве, Сочи, Казани, Санкт-Петербурге и других крупных городах.\n⭐️ Выгодные цены и быстрые сделки.\n☎️ Телефон: ${phone}.`,
    keywords: [
      'Агентство недвижимости',
      'Altera',
      'Альтера',
    ]
  },
  // Карьера
  '/career': {
    title: 'ᐉ Работа риэлтором: вакансии риэлтора в агентстве недвижимости в Казани | Altera',
    description: `🏡 Трудоустройтесь или освойте профессию риэлтора в агентстве недвижимости «Альтера» в Казани.\n⭐️ Присоединяйтесь к нашей команде.\n☎️ Телефон: ${phone}.`,
    keywords: [
      'Агентство недвижимости',
      'Altera',
      'Альтера',
    ]
  },
  // Аренда недвижимости
  '/rent-residence': {
    title: 'ᐉ Сдача недвижимости в аренду | Агентство недвижимости Altera',
    description: `🏡 Сдайте свою недвижимость в аренду с помощью риэлтора агентства «Альтера».\n⭐️ Профессиональная помощь в аренде квартир и объектов недвижимости в Москве, Сочи, Казани, Санкт-Петербурге и других городах. Быстро и выгодно.\n☎️ Телефон: ${phone}.`,
    keywords: [
      'Агентство недвижимости',
      'Altera',
      'Альтера',
    ]
  },
  // Cases
  '/case': {
    title: 'ᐉ Агентство недвижимости: риэлторское агентство | Altera',
    description: `🏡 Агентство недвижимости «Альтера» с выгодными условиями.\n⭐️ Услуги риэлтерского агентства: продажа, покупка и аренда недвижимости в Москве, Сочи, Казани, Санкт-Петербурге и других крупных городах.\n☎️ Телефон: ${phone}.`,
    keywords: [
      'Агентство недвижимости',
      'Altera',
      'Альтера',
    ]
  },

}

export default tags