import Image from 'next/image';

import image from '@/images/case/case3/image.webp';

import Container from '@/components/container';

import s from './case3.module.css';

function Case3() {
  return (
    <section className={s.section}>
      <Container>
        {/* HERO */}
        <p className={s.badge}>Кейсы</p>
        <p className={s.title}>
          Как помогли семье
          <br />
          из Северодвинска
          <br />
          купить дом в Казани
          <br />
          <span>/ удалённо /</span>
        </p>
        <div className={s.flex_wrapper}>
          <p className={s.under_title}></p>
          <div className={s.image_wrapper}>
            <Image src={image} alt="image" priority />
          </div>
          <p className={s.author}>
            Рассказывает риэлтор
            <br />
            <span>Наталья Абдиева:</span>
          </p>
        </div>

        {/* CONTENT */}

        {/* DESCRIPTION */}
        <div className={s.block}>
          <p className={s.block_title}>С чего всё началось</p>
          <div className={s.block_content}>
            <div className={s.description}>
              <p className={s.description_text}>
                Ко мне обратился клиент из Северодвинска. У них с женой только
                что родился второй ребёнок, и семья решила переехать в Казань
              </p>
              <p className={s.block_subtitle}>Возможности и пожелания семьи:</p>
              <ul className={s.description_list}>
                <li>
                  Использовать <span>материнский капитал</span> и небольшую
                  сумму в качестве первоначального взноса.
                </li>
                <li>
                  Оформить ипотеку по программе{' '}
                  <span>семейной или IT-ипотеки.</span>
                </li>
                <li>
                  Найти дом удалённо, так как семья находилась в другом городе.
                </li>
              </ul>

              <p className={s.description_text}>
                Их цель — купить готовый дом с ремонтом и земельным участком,
                чтобы обеспечить комфорт для жизни.
              </p>
              <p className={s.description_text}>
                Мы провели онлайн-консультацию, где я подробно объяснила этапы
                работы: одобрение ипотеки и подбор дома. Клиенты сразу заключили
                договор, и мы начали работу.
              </p>
            </div>
          </div>
        </div>

        {/* APPROVEMENT */}
        <div className={s.block}>
          <p className={s.block_title}>
            Одобрение ипотеки:
            <br />
            <span>неожиданные сложности</span>
          </p>
          <div className={s.block_content}>
            <p className={s.block_subtitle}>Первый этап — одобрение ипотеки.</p>
            <ul className={s.approvement_list}>
              <li>
                У клиента был хороший официальный доход и высокий кредитный
                рейтинг, поэтому я не ожидала трудностей. Однако банк неожиданно
                отказал из-за технической ошибки, указав несуществующую
                задолженность.
              </li>
              <li>
                В течение двух месяцев мы совместно с клиентом и нашими
                ипотечными брокерами решали эту проблему. В итоге, благодаря
                грамотной работе специалистов, ипотека была одобрена.
              </li>
              <li>
                Но за это время цены на загородную недвижимость выросли, и я
                начала переживать, что подходящий вариант может оказаться
                недоступным.
              </li>
            </ul>
          </div>
        </div>

        {/* SEARCHING */}
        <div className={s.block}>
          <p className={s.block_title}>
            Поиск дома:
            <br />
            <span>«Ковалинская усадьба»</span>
          </p>
          <div className={s.block_content}>
            <div className={s.searching}>
              <p>
                Мы определили, что семье нужен дом с ремонтом и земельным
                участком в локации с развитой инфраструктурой.
              </p>
              <p>
                После просмотра нескольких объектов я нашла дом в Ковалинской
                усадьбе. Это был идеальный вариант:
              </p>
              <ul className={s.searching_list}>
                <li>Цена — 10 миллионов рублей.</li>
                <li>Готовый ремонт, просторный земельный участок.</li>
                <li>Асфальтированные подъездные пути, центральная вода.</li>
              </ul>
              <p>
                Для удалённого выбора дома я лично проехалась по объектам,
                снимала видео, показывала конструктив и обсуждала с клиентами
                все детали.
              </p>

              <p>
                Мы работали в онлайн-режиме, включая переговоры с застройщиком.
              </p>
              <p>
                Дом, который выбрала семья, изначально был в предчистовой
                отделке. Я договорилась с застройщиком довести его до чистовой
                отделки в рамках нашего бюджета. Всё было включено в договор,
                чтобы минимальный первоначальный взнос покрыл часть стоимости
                через материнский капитал.
              </p>
            </div>
          </div>
        </div>

        {/* REQUESTS */}
        <div className={s.block}>
          <p className={s.block_title}>
            Уникальные
            <br />
            запросы клиента
          </p>
          <div className={s.block_content}>
            <div className={s.requests}>
              <p>
                Евгений, как IT-специалист, уделял особое внимание качеству
                интернета в доме. Он самостоятельно связывался с провайдерами, а
                я согласовывала с застройщиком штробление дополнительных каналов
                для интернет-кабеля.
              </p>
              <p>
                Этот процесс немного задержал ремонт, но мы добились нужного
                результата: дом полностью соответствовал потребностям семьи.
              </p>
            </div>
          </div>
        </div>

        {/* TEMPORARY */}
        <div className={s.block}>
          <p className={s.block_title}>Временное жильё</p>
          <div className={s.block_content}>
            <div className={s.temporary}>
              <p>
                Сделка была запланирована на июль, но застройщик не успел
                завершить отделочные работы вовремя. Семья с двумя детьми
                (младшему было 6–7 месяцев) должна была переехать из
                Северодвинска, и вопрос временного жилья стал срочным.
              </p>
              <p>
                Летом снять краткосрочную аренду сложно: посуточно — слишком
                дорого, долгосрочно — минимум на полгода.
              </p>
              <p>
                Я нашла решение через коллегу: её клиенты согласились сдать свою
                квартиру семье на месяц. Это позволило Евгению и его семье
                разместиться с комфортом и дождаться окончания ремонта.
              </p>
            </div>
          </div>
        </div>

        {/* FINAL */}
        <div className={s.block}>
          <p className={s.block_title}>Финал</p>
          <div className={s.block_content}>
            <div className={s.final}>
              <p>
                В августе ремонт был завершён, семья смогла переехать в свой
                новый дом. Всё было готово: чистовая отделка, качественный
                интернет, благоустроенный участок.
              </p>
              <p>
                На тот момент это был идеальный кейс: семья успела купить дом за{' '}
                <span>10 миллионов рублей</span>, что сейчас стало бы уже
                невозможно из-за роста цен.
              </p>
            </div>
          </div>
        </div>

        {/* CONCLUSION */}
        <div className={s.block}>
          <p className={s.block_title}>
            Итог:
            <br />
            <span>
              преимущества
              <br />
              работы с агентом
            </span>
          </p>
          <div className={s.block_content}>
            <div className={s.conclusion}>
              <p className={s.block_subtitle}>Экономия времени и ресурсов</p>
              <p className={s.conclusion_text}>
                Семья купила дом удалённо, находясь в другом городе, без
                необходимости приезжать на просмотры.
              </p>
              <p className={s.block_subtitle}>Комплексное сопровождение</p>
              <p className={s.conclusion_text}>
                Я помогла с решением вопросов по ипотеке, переговорами с
                застройщиком, организацией временного жилья и техническими
                нюансами (интернет, отделка).
              </p>
              <p className={s.block_subtitle}>Индивидуальный подход</p>
              <p className={s.conclusion_text}>
                Учтены все запросы: от качества интернета до завершения отделки.
              </p>
              <p className={s.block_subtitle}>Выгодная сделка</p>
              <p className={s.conclusion_text}>
                Дом с ремонтом и участком в Ковалинской усадьбе за 10 миллионов
                рублей — отличная покупка, особенно с учётом текущего роста цен.
              </p>
              <p className={s.conclusion_text}>
                Эта сделка показала, что даже покупка дома в другом городе может
                быть комфортной, если за дело берётся профессионал.
              </p>
            </div>
          </div>
        </div>
      </Container>
    </section>
  );
}

export default Case3;
